; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)

        (need ?p - person ?c - bcontent)
    )

    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content)(need ?person ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(need ?person ?content)))
    )
)

; problem
(define (problem emergencias-size6)
    (:domain emergencias)

    (:objects
        dron1 - dron
        person1 person2 person3 person4 person5 person6 - person
        box1 box2 box3 box4 box5 box6 - box
        comida medicina - bcontent
        deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 - location
        izquierda derecha - grip
    )

    (:init
        (at-dron dron1 deposito)
        (at-box box1 deposito)
        (at-box box2 deposito)
        (at-box box3 deposito)
        (at-box box4 deposito)
        (at-box box5 deposito)
        (at-box box6 deposito)
        (at-person person1 refugio1)
        (at-person person2 refugio2)
        (at-person person3 refugio3)
        (at-person person4 refugio4)
        (at-person person5 refugio5)
        (at-person person6 refugio6)
        (box-has box1 comida)
        (box-has box2 medicina)
        (box-has box3 comida)
        (box-has box4 medicina)
        (box-has box5 comida)
        (box-has box6 medicina)
        (need person1 comida)
        (need person2 medicina)
        (need person3 comida)
        (need person4 medicina)
        (need person5 comida)
        (need person6 medicina)
        (free izquierda)
        (free derecha)
    )

    (:goal (and
        (person-has person1 comida)
        (person-has person2 medicina)
        (person-has person3 comida)
        (person-has person4 medicina)
        (person-has person5 comida)
        (person-has person6 medicina)
    ))
)

; plan
1. (pick box4 deposito izquierda dron1)
   deleted: (at-box box4 deposito) (free izquierda)
   added: (carrying dron1 izquierda box4)
   goals met: 0 of 6
2. (pick box1 deposito derecha dron1)
   deleted: (at-box box1 deposito) (free derecha)
   added: (carrying dron1 derecha box1)
   goals met: 0 of 6
3. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 0 of 6
4. (leave box4 refugio2 izquierda dron1 person2 medicina)
   deleted: (carrying dron1 izquierda box4) (need person2 medicina)
   added: (at-box box4 refugio2) (free izquierda) (person-has person2 medicina)
   goals met: 1 of 6
5. (pick box4 refugio2 izquierda dron1)
   deleted: (at-box box4 refugio2) (free izquierda)
   added: (carrying dron1 izquierda box4)
   goals met: 1 of 6
6. (move refugio2 refugio5 dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 refugio5)
   goals met: 1 of 6
7. (leave box1 refugio5 derecha dron1 person5 comida)
   deleted: (carrying dron1 derecha box1) (need person5 comida)
   added: (at-box box1 refugio5) (free derecha) (person-has person5 comida)
   goals met: 2 of 6
8. (pick box1 refugio5 derecha dron1)
   deleted: (at-box box1 refugio5) (free derecha)
   added: (carrying dron1 derecha box1)
   goals met: 2 of 6
9. (move refugio5 refugio3 dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 refugio3)
   goals met: 2 of 6
10. (leave box1 refugio3 derecha dron1 person3 comida)
   deleted: (carrying dron1 derecha box1) (need person3 comida)
   added: (at-box box1 refugio3) (free derecha) (person-has person3 comida)
   goals met: 3 of 6
11. (pick box1 refugio3 derecha dron1)
   deleted: (at-box box1 refugio3) (free derecha)
   added: (carrying dron1 derecha box1)
   goals met: 3 of 6
12. (move refugio3 refugio6 dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 refugio6)
   goals met: 3 of 6
13. (leave box4 refugio6 izquierda dron1 person6 medicina)
   deleted: (carrying dron1 izquierda box4) (need person6 medicina)
   added: (at-box box4 refugio6) (free izquierda) (person-has person6 medicina)
   goals met: 4 of 6
14. (pick box4 refugio6 izquierda dron1)
   deleted: (at-box box4 refugio6) (free izquierda)
   added: (carrying dron1 izquierda box4)
   goals met: 4 of 6
15. (move refugio6 refugio1 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio1)
   goals met: 4 of 6
16. (leave box1 refugio1 derecha dron1 person1 comida)
   deleted: (carrying dron1 derecha box1) (need person1 comida)
   added: (at-box box1 refugio1) (free derecha) (person-has person1 comida)
   goals met: 5 of 6
17. (move refugio1 refugio4 dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 refugio4)
   goals met: 5 of 6
18. (leave box4 refugio4 izquierda dron1 person4 medicina)
   deleted: (carrying dron1 izquierda box4) (need person4 medicina)
   added: (at-box box4 refugio4) (free izquierda) (person-has person4 medicina)
   goals met: 6 of 6
